Revit 2027 API
AreaBasedLoadData.DisconnectFromUpstreamNode Method
 Disconnects from an upstream electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectFromUpstreamNode()
Public Sub DisconnectFromUpstreamNode
public:
void DisconnectFromUpstreamNode()
member DisconnectFromUpstreamNode : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The area based load can not disconnect from the upstream electrical analytical node.
Remarks
 If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace